run/realworld/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (-1.6086 6.9677 0);
flowVelocity2        (-1.6086 6.9677 0);
pressure             0;
turbulentKE          0.375;
turbulentOmega       10.0;

// ************************************************************************* //
